---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseDimensionsForCurtainWall
source: html/1bd91338-fd0c-c764-e815-12edb180e1d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseDimensionsForCurtainWall Property

Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId LooseDimensionsForCurtainWall { get; }
```